---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCTransformSetter
source: html/d9b7979c-8e83-d327-fd7e-ad314972da5c.htm
---
# IFCTransformSetter Methods

Creates a new instance of a transform setter.